Revit 2027 API
BuiltInFailures.LoadFailures.OpenAreaLoadLoopError Property
 Area Load Sketch can't contain open loops.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OpenAreaLoadLoopError { get; }
Public Shared ReadOnly Property OpenAreaLoadLoopError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OpenAreaLoadLoopError {
	FailureDefinitionId^ get ();
}
static member OpenAreaLoadLoopError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LoadFailures Class
Autodesk.Revit.DB Namespace